Public Member Functions | List of all members
IFCAPI::v1::PropertyAccessor Class Referencefinal
IFC Data Access
To access IFC attributes, properties and classification references. More...
#include <IFCPropertyAccessor.hpp>
 Inheritance diagram for IFCAPI::v1::PropertyAccessor:
 Public Member Functions
PropertyAccessor (const IFCAPI::ObjectID &objectID)
Get PropertyAccessor to access IFC attributes, properties and classification references.
ACAPI::Result< std::vector< Attribute > >  | GetAttributes () const
Get the entity's IFC attributes.
ACAPI::Result< std::vector< Property > >  | GetPreviewProperties () const
Get the entity's preview IFC properties.
ACAPI::Result< std::vector< Property > >  | GetLocalProperties () const
Get the entity's local IFC properties.
ACAPI::Result< std::vector< ClassificationReference > >  | GetPreviewClassificationReferences () const
Get the entity's preview IFC classification references.
ACAPI::Result< std::vector< ClassificationReference > >  | GetLocalClassificationReferences () const
Get the entity's IFC classification references.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
To access IFC attributes, properties and classification references.
Since
Archicad 28